FKDD_COPY_DIFF_3_2026-02-13/Enums/СпособыВыпускаВОборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВыпускаВОборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортВРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансграничнаяТорговля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/СпособыЗаполненияСерийногоНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыЗаполненияСерийногоНомера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидыДокументовСоответствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДокументовСоответствия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СертификатСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияОСоответствии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ПричиныПеремаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныПеремаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспорченаМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВОписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБезМаркировкиРозничнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБезМаркировкиДистанционнаяПродажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассовыйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварныйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможеннаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктУничтожения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ПричиныСписанияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныСписанияКодовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утерян</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уничтожен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидыВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыВозвратов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриРозничнойРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриДистанционномСпособе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекВозврата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидыОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОтгрузкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ПричиныОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныОтгрузкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезВозмезднаяПередача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеГосПредприятием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеДляСобственныхНуждПокупателем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/УправлениеКодамиМаркировкиКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Очищает представления с кодами маркировки с криптохвостами после печати
//
Процедура ОчисткаНапечатанныхКодовМаркировки(СтруктураПараметров) Экспорт
	
	Если НЕ СтруктураПараметров.Свойство("СрокХраненияКодаМаркировки") Тогда
		Возврат;
	КонецЕсли;
	
	// Не указан срок хранения кодов
	СрокХранения = СтруктураПараметров.СрокХраненияКодаМаркировки;
	Если СрокХранения = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КодыМаркировкиДляПечати.ДокументОснование КАК ДокументОснование,
	               |	КодыМаркировкиДляПечати.Номенклатура КАК Номенклатура,
	               |	КодыМаркировкиДляПечати.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	КодыМаркировкиДляПечати.КодМаркировки КАК КодМаркировки
	               |ИЗ
	               |	РегистрСведений.КодыМаркировкиДляПечати КАК КодыМаркировкиДляПечати
	               |ГДЕ
	               |	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КодыМаркировкиДляПечати.ДатаПечати, ДЕНЬ), &ТекущаяДата, ДЕНЬ) >= &СрокХранения
	               |	И КодыМаркировкиДляПечати.ДатаПечати <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СрокХранения", СрокХранения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Чистим код маркировки для всех найденных записей
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.КодыМаркировкиДляПечати.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		Набор.Отбор.ХарактеристикаНоменклатуры.Установить(Выборка.ХарактеристикаНоменклатуры);
		Набор.Отбор.КодМаркировки.Установить(Выборка.КодМаркировки);
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроЦедуры // ОчисткаНапечатанныхКодовМаркировки()

// Создает документы с разбивкой по 10 строк заказ на маркировку
//
Процедура СформироватьЗаказыНаКодыМаркировки(Основание) Экспорт
	
	Если ТипЗнч(Основание) <> Тип("ДокументОбъект.ЗаказКодовМаркировки") Тогда
		ДокументОбъект = Документы.ЗаказКодовМаркировки.СоздатьДокумент();
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьОграничениеСтрок");
		ДокументОбъект.Заполнить(Основание);
		ОснованиеДокумента = Основание;
	Иначе
		ДокументОбъект = Основание;
		ОснованиеДокумента = ДокументОбъект.ДокументОснование;
	КонецЕсли;
	
	// Разберем полученный документ на несколько по 10 строк
	КоличествоСтрок = ДокументОбъект.Товары.Количество();
	
	СписокДокументов = Новый Массив;
	
	НачатьТранзакцию();
	
	Пока КоличествоСтрок > 0 Цикл
		
		НовыйДокумент = Документы.ЗаказКодовМаркировки.СоздатьДокумент();
		НовыйДокумент.ДополнительныеСвойства.Вставить("НеПроверятьОграничениеСтрок");
		НовыйДокумент.Заполнить(ОснованиеДокумента);
		НовыйДокумент.УстановитьНовыйНомер();
		НовыйДокумент.Товары.Очистить();
		
		КоличествоНоменклатуры = Мин(ДокументОбъект.Товары.Количество(), 10);
		
		МассивУдалить = Новый Массив;
		
		Для Инд = 0 По (КоличествоНоменклатуры - 1) Цикл
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДокументОбъект.Товары[Инд]);
			
			МассивУдалить.Добавить(ДокументОбъект.Товары[Инд]);
			
		КонецЦикла;
		
		Попытка
			НовыйДокумент.ОбменДанными.Загрузка = Истина;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			СписокДокументов.Добавить(НовыйДокумент.Ссылка);
		Исключение
			ОтменитьТранзакцию();
			#Если Клиент Тогда
				Сообщить("При формировании заказа на маркировку обнаружена ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			#КонецЕсли
			Прервать;
		КонецПопытки;
		
		КоличествоСтрок = КоличествоСтрок - КоличествоНоменклатуры;
		
		// Удалим заполненные строки
		Для Каждого ТекущаяСтрока Из МассивУдалить Цикл
			ДокументОбъект.Товары.Удалить(ТекущаяСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	Попытка
		ЗафиксироватьТранзакцию();
		#Если Клиент Тогда
			Сообщить("Созданы по данному документы заказы на эмиссию кодов маркировки. Необходимо завершить заполнение документов и отправить запрос в Честный знак.", СтатусСообщения.Важное);
			Для Каждого ТекущийДокумент Из СписокДокументов Цикл
				Сообщить(Строка(ТекущийДокумент.Ссылка));
			КонецЦикла;
		#КонецЕсли
	Исключение
		ОтменитьТранзакцию();
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
			Сообщить("Формирование заказов кодов маркировки отменено", СтатусСообщения.Внимание);
		#КонецЕсли
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

// Делает запись в регистр "Коды маркировки для печати" кодов маркировки с криптохвостами.
//
// Параметры:
//  Ссылка - ДокументСсылка.ЗаказКодовМаркировки - документ заказа кодов маркировки;
//  КодыМаркировки - ТаблицаЗначений - таблица, содержащая информацию о кодах маркировки:
//    * Номенклатура - СправочникСсылка.Номенклатура - номенклатура;
//    * ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикаНоменклатуры - характеристика номенклатуры;
//    * КодМаркировки - Строка - полученный полный код маркировки.
//  ОписаниеОшибки - Строка - ошибки, возникшие при записи в регистр
//
Процедура ДобавитьЗаписиВРегистр(Ссылка, КодыМаркировки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.КодыМаркировкиДляПечати.ДобавитьЗаписиВРегистр(Ссылка, КодыМаркировки);
	
КонецПроцедуры

Функция ВидПродуции(Документ) Экспорт
	
	Попытка
		ВидПродукции = Документ.ТоварнаяГруппа.ТоварнаяГруппа;
	Исключение
		ВидПродукции = "";
	КонецПопытки;
	
	Возврат ВидПродукции;
	
КонецФункции

Функция ИдентификаторШаблонаЭтикетки(Документ) Экспорт
	
	Попытка
		Идентификатор = Документ.ТоварнаяГруппа.КодТоварнойГруппы;
	Исключение
		Идентификатор = "";
	КонецПопытки;
	Возврат Идентификатор;
	
КонецФункции

Функция СпособВыпускаВОборот(СпособВыпуска) Экспорт
	
	Если СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ПроизводствоРФ Тогда
		Возврат "PRODUCTION";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.МаркировкаОстатков Тогда
		Возврат "REMAINS";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ТрансграничнаяТорговля Тогда
		Возврат "CROSSBORDER";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ИмпортВРФ Тогда
		Возврат "IMPORT";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.Перемаркировка Тогда
		Возврат "REMARK";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определен способ выпуска в оборот!");
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции

Функция СпособЗаполненияСерийныхНомеров(ЗначениеСпособаЗаполнения) Экспорт 
	
	Если ЗначениеСпособаЗаполнения = Перечисления.СпособыЗаполненияСерийногоНомера.Автоматически Тогда
		Возврат "OPERATOR"
	ИначеЕсли ЗначениеСпособаЗаполнения = Перечисления.СпособыЗаполненияСерийногоНомера.Ручной Тогда
		Возврат "SELF_MADE";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определен способ заполнения серийных номеров!");
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции 

Функция ПолучитьТаблицуУпращенногоВводаМаркировок(Документ) Экспорт
	
	// Пока только для моделей
	ТаблицаТоваров = Новый Массив;
	
	МассивМоделей = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		
		model = СокрЛП(ТекущаяСтрока.Модель);
		
		Если НЕ ПустаяСтрока(ТекущаяСтрока.GTIN)
			ИЛИ ПустаяСтрока(model)
			ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодТНВЭД)
			ИЛИ МассивМоделей.Найти(model) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КодТНВЭД = Лев(ТекущаяСтрока.КодТНВЭД.Код, 2);
		
		НоваяСтрока = Новый Структура();
		НоваяСтрока.Вставить("Код", КодТНВЭД);
		НоваяСтрока.Вставить("model", model);
		ТаблицаТоваров.Добавить(НоваяСтрока);
		
		МассивМоделей.Добавить(model);
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ВидДокументаСоответствия(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыДокументовСоответствия.ДекларацияОСоответствии Тогда
		Возврат "CONFORMITY_DECLARATION";
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументовСоответствия.СертификатСоответствия Тогда
		Возврат "CONFORMITY_CERTIFICATE";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВидДокументаСоответствияCSV(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыДокументовСоответствия.ДекларацияОСоответствии Тогда
		Возврат "Декларация соответствия";
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументовСоответствия.СертификатСоответствия Тогда
		Возврат "Сертификат соответствия";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаПеремаркировки(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныПеремаркировки.ИспорченаМаркировка Тогда
		Возврат "KM_SPOILED";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ОшибкаВОписании Тогда
		Возврат "DESCRIPTION_ERRORS";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиДистанционнаяПродажа Тогда
		Возврат "REMOTE_SALE_RETURN";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа Тогда
		Возврат "RETAIL_RETURN";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПричинаПеремаркировки()

Функция ВидПервичногоДокумента(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыПервичныхДокументов.КассовыйЧек Тогда
		Возврат "RECEIPT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварныйЧек Тогда
		Возврат "SALES_RECEIPT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТаможеннаяДекларация Тогда
		Возврат "CUSTOMS_DECLARATION";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.УПД Тогда
		Возврат "UTD";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварнаяНакладная Тогда
		Возврат "CONSIGNMENT_NOTE";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.АктУничтожения Тогда
		Возврат "DESTRUCTION_ACT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
		Возврат "OTHER";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаВыводаИзОборота(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныВыводаИзОборота.РозничнаяПродажа Тогда
		Возврат "RETAIL";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ЭкспортЕАЭС Тогда
		Возврат "EAS_TRADE";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Экспорт Тогда
		Возврат "BEYOND_EEC_EXPORT";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Возврат Тогда
		Возврат "RETURN";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДистанционнаяПродажа Тогда
		Возврат "DISTANCE";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.УтратаПовреждение Тогда
		Возврат "LOSS";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Уничтожение Тогда
		Возврат "DESTRUCTION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Конфискация Тогда
		Возврат "CONFISCATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Ликвидация Тогда
		Возврат "LIQUIDATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДляСобственныхНужд Тогда
		Возврат "OWN_USE";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.БезвозмезднаяПередача Тогда
		Возврат "DONATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоГосКонтракту Тогда
		Возврат "STATE_CONTRACT";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоОбразцам Тогда
		Возврат "BY_SAMPLES";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоСделкеСГгосударственнойТайной Тогда
		Возврат "STATE_SECRET";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Утилизация Тогда
		Возврат "UTILIZATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Другое Тогда
		Возврат "OTHER";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определена причина вывода из оборота. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ПричинаВыводаИзОборотаCSV(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныВыводаИзОборота.РозничнаяПродажа Тогда
		Возврат "Розничная продажа";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ЭкспортЕАЭС Тогда
		Возврат "Трансграничная продажа в страны ЕАЭС";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Экспорт Тогда
		Возврат "Экспорт за пределы стран ЕАЭС";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Возврат Тогда
		Возврат "Возврат физическому лицу";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДистанционнаяПродажа Тогда
		Возврат "Дистанционная продажа";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.УтратаПовреждение Тогда
		Возврат "Утрата";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Уничтожение Тогда
		Возврат "Уничтожение";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Конфискация Тогда
		Возврат "Конфискация";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Ликвидация Тогда
		Возврат "Ликвидация предприятия";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДляСобственныхНужд Тогда
		Возврат "Использование для собственных нужд";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.БезвозмезднаяПередача Тогда
		Возврат "Безвозмездная передача";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоГосКонтракту Тогда
		Возврат "Продажа по государственному (муниципальному) контракту";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоОбразцам Тогда
		Возврат "Продажа по образцам";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоСделкеСГосТайной Тогда
		Возврат "Продажа по сделке с государственной тайной";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Утилизация Тогда
		Возврат "Утилизация";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Другое Тогда
		Возврат "Другое";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определена причина вывода из оборота. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ВидПервичногоДокументаCSV(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыПервичныхДокументов.КассовыйЧек Тогда
		Возврат "Кассовый чек";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварныйЧек Тогда
		Возврат "Товарный чек";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТаможеннаяДекларация Тогда
		Возврат "Таможенная декларация на товары";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.УПД Тогда
		Возврат "Универсальный передаточный документ";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварнаяНакладная Тогда
		Возврат "Товарная накладная";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.АктУничтожения Тогда
		Возврат "Акт уничтожения (утраты/утилизации)";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
		Возврат "Прочее";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаСписанияКодаМаркировки(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныСписанияКодовМаркировки.Испорчен Тогда
		Возврат "KM_SPOILED";
	ИначеЕсли Причина = Перечисления.ПричиныСписанияКодовМаркировки.Уничтожен Тогда
		Возврат "KM_DESTROYED";
	ИначеЕсли Причина = Перечисления.ПричиныСписанияКодовМаркировки.Утерян Тогда
		Возврат "KM_LOST";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определена причина списания кода маркировки. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ВидВозвратаВОборот(ВидВозврата) Экспорт
	
	Если ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации Тогда
		Возврат "RETAIL_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриДистанционномСпособе Тогда
		Возврат "REMOTE_SALE_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ЧекВозврата Тогда
		Возврат "RECEIPT_RETURN";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определен вид возврата в оборот кода маркировки. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ВидВозвратаВОборотCSV(ВидВозврата) Экспорт
	
	Если ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации Тогда
		Возврат "Возврат при розничной реализации";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриДистанционномСпособе Тогда
		Возврат "Возврат при дистанционном способе продажи";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ЧекВозврата Тогда
		Возврат "Чек возврата";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определен вид возврата в оборот кода маркировки. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ВидТоварооборота(ВидОтгрузкиТоваров) Экспорт
	
	Если ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Продажа Тогда
		Возврат "Продажа";
	ИначеЕсли ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Комиссия Тогда
		Возврат "Комиссия";
	ИначеЕсли ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Агент Тогда
		Возврат "Агент";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаОтгрузкиТовара(ПричинаВыводаИзОборота) Экспорт
	
	Если ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.БезВозмезднаяПередача Тогда
		Возврат "Безвозмездная передача";
	ИначеЕсли ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.ПриобретениеГосПредприятием Тогда
		Возврат "Приобретение гос.предприятием";
	ИначеЕсли ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.ИспользованиеДляСобственныхНуждПокупателем Тогда
		Возврат "Использование для собственных нужд покупателем";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции


#КонецОбласти
